import { clsx, type ClassValue } from "clsx";
import { twMerge } from "tailwind-merge";

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs));
}

export const navbarLinks = [
  {
    link: "/",
    label: " صفحه اصلی",
  },
  {
    link: "/under-construction",
    label: " آمار و احتمالات",
  },
  {
    link: "/under-construction",
    label: " کتابخانه الکترونیک",
  },
  {
    link: "/under-construction",
    label: " طرح سیمرغ",
  },
  {
    link: "/committees",
    label: "هئیت های استانی ",
  },
  {
    link: "/under-construction",
    label: " فراکوه",
  },
];

export const heroNavLinks = ["دوره های آموزشی", "مربیان", "باشگاه ها"];

export const news = [
  {
    img: "/akhbar.jpg",
    text: "تیم ملی کوهنوردی ایران در یک صعود افتخارآفرین موفق به فتح قله ۵۱۳۷ متری آرارات در ترکیه شد. این صعود به مناسبت هفته کوهنوردی انجام شد و اعضای تیم با حمل پرچم ایران در قله، این موفقیت را جشن گرفتند.",
  },
  {
    img: "/akhbar-2.jpg",
    text: "تیم ملی کوهنوردی ایران در یک صعود افتخارآفرین موفق به فتح قله ۵۱۳۷ متری آرارات در ترکیه شد. این صعود به مناسبت هفته کوهنوردی انجام شد و اعضای تیم با حمل پرچم ایران در قله، این موفقیت را جشن گرفتند.",
  },
  {
    img: "/person-1.jpg",
    text: "تیم ملی کوهنوردی ایران در یک صعود افتخارآفرین موفق به فتح قله ۵۱۳۷ متری آرارات در ترکیه شد. این صعود به مناسبت هفته کوهنوردی انجام شد و اعضای تیم با حمل پرچم ایران در قله، این موفقیت را جشن گرفتند.",
  },
  {
    img: "/person-2.jpg",
    text: "تیم ملی کوهنوردی ایران در یک صعود افتخارآفرین موفق به فتح قله ۵۱۳۷ متری آرارات در ترکیه شد. این صعود به مناسبت هفته کوهنوردی انجام شد و اعضای تیم با حمل پرچم ایران در قله، این موفقیت را جشن گرفتند.",
  },
];

export const ranking = [
  { name: "محمد علی اصلاحی", img: "/acs.jpg" },
  { name: "سروش روحانی", img: "/acs.jpg" },
  { name: "وریا گل کار", img: "/acs.jpg" },
  { name: "عليرضا کياني", img: "/acs.jpg" },
  { name: "ابوالفضل غفاری", img: "/acs.jpg" },
  { name: "عبدالله فاتحی", img: "/acs.jpg" },
  { name: "یونس خالدیان", img: "/acs.jpg" },
  { name: "اسماعیل غفوری", img: "/acs.jpg" },
  { name: "رمضان توحیدی", img: "/acs.jpg" },
  { name: "محمد صباح پرسته", img: "/acs.jpg" },
  { name: "عبداله درودی", img: "/acs.jpg" },
  { name: "فریدون گرگانی", img: "/acs.jpg" },
];

export const mobileNavbar = [
  {
    label: "صفحه اصلی ",
    link: "/",
  },
  {
    label: "آمار و اطلاعات ",
    link: "/",
  },
  {
    label: "دوره های آموزشی ",
    link: "/",
  },
  {
    label: "باشگاه ها ",
    link: "/",
  },
  {
    label: "مربیان ",
    link: "/",
  },
  {
    label: "شرکت های تامین تجهیزات ",
    link: "/",
  },
  {
    label: "رزومه کوه نوردان ",
    link: "/",
  },
  {
    label: "کتابخانه الکترونیک ",
    link: "/",
  },
  {
    label: "طرح سیمرغ ",
    link: "/",
  },
  {
    label: "هئیت های استانی",
    link: "/committees",
  },
  {
    label: "فراکوه ",
    link: "/",
  },
  {
    label: "درباره ما ",
    link: "/",
  },
  {
    label: "تماس با ما ",
    link: "/",
  },
];

export const accordions = [
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان آذربایجان شرقی",
    boss: "آقای میر علی آقاسیدی",
    secretary: "آقای حجت آزادی",
    viceP: "خانم حبیبه صدیقی",
    educationOfficer: "آقای هادی سرداری",
    phones: "35532970-041",
    address: "تبریز - میدان منظریه - مجتمع فرهنگی کوثر",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان آذربایجان غربی",
    boss: "آقای حسین شریفی",
    secretary: "آقای سعید کاظمی",
    viceP: "خانم نسرین کریمی",
    educationOfficer: "آقای محمدرضا قنبری",
    phones: "33456789-044",
    address: "ارومیه - خیابان ورزش - ساختمان هیئت‌های ورزشی",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان اردبیل",
    boss: "آقای رضا رضایی",
    secretary: "آقای علی محمدی",
    viceP: "خانم فاطمه نصیری",
    educationOfficer: "آقای مصطفی شریفی",
    phones: "32765432-045",
    address: "اردبیل - خیابان دانشگاه - سالن ورزشی انقلاب",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان اصفهان",
    boss: "آقای علی رضایی",
    secretary: "آقای مجید صالحی",
    viceP: "خانم مریم زمانی",
    educationOfficer: "آقای سعید هاشمی",
    phones: "36298765-031",
    address: "اصفهان - خیابان چهارباغ - ورزشگاه انقلاب",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان البرز",
    boss: "آقای محمد اسدی",
    secretary: "آقای رضا شاکری",
    viceP: "خانم نرگس صادقی",
    educationOfficer: "آقای امیر مهدوی",
    phones: "32567890-026",
    address: "کرج - خیابان مطهری - اداره کل ورزش و جوانان",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان ایلام",
    boss: "آقای حسین قادری",
    secretary: "آقای جلیل رضایی",
    viceP: "خانم نسرین رحیمی",
    educationOfficer: "آقای حسن علیزاده",
    phones: "33456789-084",
    address: "ایلام - میدان معلم - سالن ورزشی ایلام",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان بوشهر",
    boss: "آقای مرتضی احمدی",
    secretary: "آقای سعید مرادی",
    viceP: "خانم الهام شریفی",
    educationOfficer: "آقای حسن قربانی",
    phones: "34567890-077",
    address: "بوشهر - بلوار امام - مجتمع ورزشی خلیج فارس",
  },
  {
    title: "هئیت کوهنوردی و صعود های ورزشی استان تهران",
    boss: "آقای محمد احمدی",
    secretary: "آقای رضا عباسی",
    viceP: "خانم سارا کریمی",
    educationOfficer: "آقای محمود مرادی",
    phones: "22876543-021",
    address: "تهران - میدان هفت تیر - فدراسیون کوهنوردی",
  },
];
